---
kind: enumMember
id: F:Autodesk.Revit.DB.Visibility.Contextual
enum: Autodesk.Revit.DB.Visibility
source: html/0927cebc-d2fc-3411-26d7-1927f3b68e09.htm
---
# Autodesk.Revit.DB.Visibility.Contextual

The geometry object is visible in some contexts, but not in others. This type of geometry is always returned by
 Geometry[Options] ,
even when Revit is in a context where the geometry should not be visible, but only if
 IncludeNonVisibleObjects is true.
Examples of geometry of this class include Solids representing insulation and lining for MEP ducts and pipes.